Tekla Open API Reference for Tekla Structures 2025
DisposableToken Class
IDisposable delegate adapter.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.DisposableToken
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DisposableToken : IDisposable
Public NotInheritable Class DisposableToken
	Implements IDisposable
The DisposableToken type exposes the following members.
Constructors
Name | Description
DisposableToken
 Initializes a new instance of the DisposableToken class.
Top
Methods
Name | Description
Dispose
 Invokes the callback.
Top
Operators
Name | Description
Addition
 Combines the two disposable objects.
Top
Fields
Name | Description
None
 The default instance that does nothing.
Top
Examples
IDisposable InitiateOperation()
{
    var token = Disposable.None;
    try
    {
        token += new Disposable(() => FinalizeOnePart());
        token += new Disposable(() => FinalizeOtherPart());
        return token;
    }
    catch
    {
        token.Dispose();
        throw;
    }
}
See Also
Reference
Tekla.Structures.Model Namespace